Revit 2021.1 API
Units.SetFormatOptions Method
Overload List
Name | Description
SetFormatOptions(ForgeTypeId, FormatOptions)
 Sets the default FormatOptions for a spec.
SetFormatOptions(UnitType, FormatOptions) |  Obsolete.
 Sets the default FormatOptions for a unit type.
See Also
Units Class
Units Members
Autodesk.Revit.DB Namespace